# DNS偵察
## 0. 概要
- 攻撃者はDNSサービスを利用して以下のような組織に関する詳細な情報を収集することができる
  - `IPアドレス`
  - `ホスト名`
  - `メールアドレス`
  - `MXレコード`
- DNSを調査するツールは主に`nslookup`と`dig`のふたつがあるが、`dig`の方がより詳細な情報を取得できる 
  
## 1. 具体的な手法
### 1-1. 権威DNSサーバーの特定（Authoritative DNS Server）
- 権威DNSとは、特定のドメイン名に関する正式な情報を管理・提供するDNSサーバーのこと。平たく言えば、組織の公開DNSサーバー
- DNS偵察をするときは一般的に権威DNSサーバーを調査する
- その権威DNSサーバーを特定する方法としては以下の方法がある
  - `whois`で検索する
  - `whoisコマンド`で検索する 
  - 両者ともドメイン情報が取得できる
  
```bash
whois [オプション] ドメイン名またはIPアドレス
```
```bash 
#実行例
whois google.com
whois 8.8.8.8
```
  
### 1-2. Digの使い方
- **1-2-1.基本的な使い方**
```bash
dig example.com
```
- example.comのAレコード（IPv4）が返ってくる
  
- **1-2-2.特定のレコードタイプを指定**
```bash
dig example.com MX  # MXレコード(メールサーバー)を問い合わせ
dig example.com NS  # NSレコード(ネームサーバー)を問い合わせ
```
  
- **1-2-3.短い出力形式**
```bash
dig example.com +short
```
- Answer部分だけ返ってくるから見やすい
- SANSもこの形式を推奨
  
- **1-2-4.逆引き**
```bash
dig -x 8.8.8.8
```
  
- **1-2-5.特定のDNSサーバーを指定**
```bash
dig @8.8.8.8 example.com
```
- `@`オプションの後にDNSサーバーのIPやドメインを入れることで、聞きに行くDNSを指定できる
- 調査の際はこのやり方がデフォルト

### 1-3.Digを使った調査手法
- その時の応じたやり方があるが、基本とするのは以下のようなコマンド
```bash
dig +short @172.30.0.254 A www.falsimentis.com
```
- `+short修飾子`を付けることで出力結果を見やすくする
- `@`オプションをつけないてDNSサーバーを特定しないとDNS調査にならない
- `Aレコード`などのDNSレコードを特定する。特にMXレコードなどの情報を取得したいときなどはその時に応じてDNSレコードを特定した方がよい
- 当然解決したいドメイン名を指定する

### 1-4.DNSゾーン転送攻撃
- **攻撃の概要**
  - DNSゾーン転送攻撃は、DNSサーバーの設定不備を悪用して、本来アクセスが許可できないはずの第三者がDNSゾーン情報を不正に取得する攻撃のこと
  - 攻撃者はDNSサーバーにゾーン転送要求を送信し、DNSゾーンにある情報をすべて取得する
- **流出する情報**
  - ホスト名とIPアドレスの一覧
  - サブドメイン情報
  - メールサーバー情報など
- **攻撃による影響**
  - NW構成の推測が可能になる
  - サービスの提供形態が分析できる
  - 攻撃の準備段階で悪用される
-  具体的なやり方
  - DNSゾーン転送攻撃は、digでDNSレコードに`AXFR`を指定し、対象のドメインを指定（falsimentis.com）することで実行できる  
```bash
dig +short @172.30.0.254 AXFR falsimentis.com
```
  
### 1-5. メールサーバーの特定手法
- digでWebサーバーなどの名前解決する際は、Webサーバーのホスト名（例えば、www.example.com）を指定しなければならないが、メールサーバーに関しては、DNSレコードにMXレコードを指定し、組織のドメイン名（例えば、example.com）を指定することで、当該ドメインに関連するメールサーバーのホスト名が取得できる。
- このことでどのようなメールサーバーを使っているかの情報を収集できる（例えば、outlook,postfixなど）
```bash
dig +short @100.100.100.100 MX example.com
```

## 2.高度な手法
### 自動的なDNSサブドメイン推測
- 基本の考え方
  - 攻撃者は任意のドメイン名で名前解決することができるので、よく使われるサブドメインを推測してDNSにリクエストを送り組織の内部構成の情報を収集することが出来る
  - よく使われるサブドメインは以下の通り
    - www.example.com
    - ns.example.com
    - admin.example.com
  - しかし手動でリクエストを送っていてもきりがないので、代わりにNSEなどの自動DNS名推測ツールを使用して自動化すること推奨される 
- **Nmap dns-bruteスクリプト**
  - Nmap dns-bruteスクリプトは、サブドメインのリストを使用して、指定したDNSサーバーに対し、サブドメインの推測を自動化してくれるスクリプト
    - Nmap dns-bruteスクリプトがもつデフォルトのサブドメインリスト： `/usr/share/namp/nselib/data/vhosts-default.lst`
    - 127個のサブドメインが一行づつ書いてある
  - コマンド
```bash
sudo nmap --dns-server <IPアドレス> --script dns-brute --script-args dns-brute.domain=<ドメイン名>

# 例 
sudo nmap --dns-server 100.100.100.100 --script dns-brute --script-args dns-brute.domain=example.com
```
